#+TITLE: Utility
**** growl
     Growl できるっぽい. Growl for windows で通知できるか??
     - [[http://www.emacswiki.org/emacs/ErcGrowl][EmacsWiki: Erc Growl]]
     - https://github.com/samaaron/samaaron-pack/blob/master/config/erc-growl.el
     - https://gist.github.com/danielsz/ac19353e718dde3dea72
     - [[http://qiita.com/rohinomiya/items/5e485d6700eac256af9f][Windows で Growl 通知を行う - Qiita]]

    Growl を利用すると, Alt+x, Alt+Shift+x が利用できなくなるという
    致命的な問題がある.

    %USERPROFILE%\Local Settings\Application Data\Growl\2.0.0.0\user.config

    で Alt+X とかいてあるところをべつのものに修正すればいい.
    - [[http://stackoverflow.com/questions/6495050/how-can-i-use-alt-as-meta-key-in-windows-for-emacs-23-especially-m-x][How can I use Alt as meta key in Windows for Emacs 23, especially M-x? - Stack Overflow]]
    - https://groups.google.com/forum/#!topic/growl-for-windows/Yu3bo3EZ9SA

    To Do Chi Ku という通知用のインタファースもあるが動かなかった
    - [[http://www.emacswiki.org/emacs/ToDoChiKu][EmacsWiki: To Do Chi Ku]]
    - [[http://justinsboringpage.blogspot.jp/2009/09/making-emacs-growl.html][justinhj's coding blog: Making emacs growl]]

#+begin_src emacs-lisp
(when windows-p
  (use-package my-growl-for-windows)
  )
#+end_src

#+RESULTS:
: Could not load package my-growl-fow-windows

